Repository: CS2487/e_commerce_online
Catalog: StudioProjects/masrofaty/lib/l10n/app_*.arb
Languages: ar

# appName
source: Hisabak
ar: حسابك

# appVersion
source: Version {version}
ar: الإصدار {version}

source: Home
ar: الرئيسية

source: Clients
ar: العملاء

source: Transactions
ar: المعاملات

source: Reports
ar: التقارير

source: Client Reports
ar: تقارير العملاء

source: Settings
ar: الإعدادات

source: Help
ar: المساعدة

source: About App
ar: حول التطبيق

source: OK
ar: موافق

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Share
ar: مشاركة

# shareTooltip
source: Share
ar: مشاركة

# splashSubtitle
source: Your perfect financial companion
ar: رفيقك المالي الأمثل

# pinCreate
source: Create a new PIN
ar: أنشئ رمز PIN جديد

# pinConfirm
source: Re-enter PIN to confirm
ar: أعد إدخال الرمز للتأكيد

# pinLogin
source: Enter PIN to unlock the app
ar: أدخل رمز PIN لفتح التطبيق

# pinMismatch
source: PINs do not match, try again
ar: الرمزان غير متطابقان، حاول مرة أخرى

# pinWrong
source: Incorrect PIN
ar: رمز PIN غير صحيح

# pinBiometricReason
source: Please authenticate to unlock the app
ar: يرجى المصادقة لفتح التطبيق

# pinNoBiometricSupport
source: Your device does not support biometrics
ar: جهازك لا يدعم البصمة

# pinBiometricError
source: An error occurred while verifying biometrics
ar: حدث خطأ أثناء التحقق من البصمة

# pinBiometricButton
source: Sign in with fingerprint
ar: تسجيل الدخول بالبصمة

# currencyLocal
source: Local
ar: محلي

# currencyDollar
source: Dollar
ar: دولار

# currencySaudi
source: Saudi
ar: سعودي

# currency
source: SAR
ar: ريال

source: Transaction Type
ar: نوع المعاملة

# creditType
source: Credit
ar: لك

# debitType
source: Debit
ar: عليك

source: Add Transaction
ar: إضافة معاملة

# deleteConfirmTitle
source: Confirm Deletion
ar: تأكيد الحذف

# deleteConfirmContent
source: Are you sure you want to delete the client "{clientName}"? All their transactions will also be deleted.
ar: هل أنت متأكد من حذف العميل "{clientName}"؟ سيتم حذف جميع معاملاته.

# noClientsTitle
source: No Clients Found
ar: لا يوجد عملاء

# noClientsSubtitle
source: Start by adding a new client
ar: ابدأ بإضافة عميل جديد

# noSearchResultsTitle
source: No Search Results
ar: لا توجد نتائج للبحث

# noSearchResultsSubtitle
source: Try searching with different keywords
ar: جرب البحث بكلمات مختلفة

# summaryFooter
source: Clients: {count}, Credit: {credit}, Debit: {debit}
ar: العملاء: {count}، لك: {credit}، عليك: {debit}

# sortByNameAsc
source: Name Ascending
ar: الاسم تصاعدي

# sortByNameDesc
source: Name Descending
ar: الاسم تنازلي

# sortByHighestBalance
source: Highest Balance
ar: أعلى رصيد

# sortByLowestBalance
source: Lowest Balance
ar: أقل رصيد

# sortByTransactionCount
source: Transaction Count
ar: عدد المعاملات

# filterAll
source: All
ar: الكل

# filterOthers
source: Others
ar: آخر

# filterSuppliers
source: Suppliers
ar: موردين

# periodAll
source: All
ar: الكل

# periodThisMonth
source: This Month
ar: هذا الشهر

# periodLastMonth
source: Last Month
ar: الشهر الماضي

# periodLast3Months
source: Last 3 Months
ar: آخر 3 أشهر

# periodLast6Months
source: Last 6 Months
ar: آخر 6 أشهر

# periodThisYear
source: This Year
ar: هذا العام

# periodCustom
source: Custom Period
ar: فترة مخصصة

source: Selected Period:
ar: الفترة المحددة:

source: Showing data for all periods
ar: عرض بيانات جميع الفترات

# from
source: From: {date}
ar: من: {date}

# to
source: To: {date}
ar: إلى: {date}

# reportDate
source: Report Date: {date}
ar: تاريخ التقرير: {date}

source: Last updated
ar: تم التحديث آخر مرة

# errorDeletingClient
source: Error deleting client: {error}
ar: خطأ في حذف العميل: {error}

# errorLoadingClientReports
source: Error loading client reports: {error}
ar: خطأ في تحميل تقارير العملاء: {error}

# comingSoonTitle
source: Coming Soon
ar: قريباً

# comingSoonContent
source: This feature will be available in upcoming versions.
ar: هذه الميزة ستكون متاحة في الإصدارات القادمة.

# helpDialogTitle
source: Help
ar: المساعدة

# helpDialogContent
source: How to use the app: 1. Add a new client from the home screen 2. Tap on a client to manage their transactions 3. Add a new transaction (credit/debit) 4. Use the menu to edit, delete, or print 5. Use search to find clients or transactions
ar: كيفية استخدام التطبيق: 1. أضف عميل جديد من الشاشة الرئيسية 2. اضغط على العميل لإدارة معاملاته 3. أضف معاملة جديدة (لك/عليك) 4. استخدم القائمة لتعديل أو حذف أو طباعة 5. استخدم البحث للعثور على العملاء أو المعاملات

# aboutDialogTitle
source: About App
ar: حول التطبيق

# aboutDialogContent
source: {appName} An app to manage clients and financial transactions The app provides: • Client management • Financial transaction tracking • Receipt printing • Financial reports • Data backup
ar: {appName} تطبيق لإدارة العملاء والمعاملات المالية يوفر التطبيق: • إدارة العملاء • تتبع المعاملات المالية • طباعة الإيصالات • تقارير مالية • نسخ احتياطي للبيانات

# copyright
source: © {year} {appName}. All rights reserved
ar: © {year} {appName}. جميع الحقوق محفوظة

# shareClientReportTitle
source: Share Client Report
ar: مشاركة تقرير العملاء

# exportClientsCSV
source: Export CSV - Clients
ar: تصدير CSV - العملاء

# exportClientsCSVSubtitle
source: List of clients with balances and transaction counts
ar: قائمة العملاء مع الأرصدة وعدد المعاملات

# shareTextSummary
source: Share Text - Client Summary
ar: مشاركة نصية - ملخص العملاء

# shareTextSummarySubtitle
source: Summary of client statistics as text
ar: ملخص إحصائيات العملاء كنص

source: Client Report
ar: تقرير العميل

# clientName
source: Name
ar: الاسم

source: Phone Number
ar: رقم الهاتف

source: Accounts
ar: الحسابات

source: Credit (For you)
ar: له

source: Debit (On you)
ar: عليك

source: Accounts Summary Report
ar: تقرير ملخص الحسابات

source: All Data
ar: جميع البيانات

source: General Summary
ar: الملخص العام

source: Client Count
ar: عدد العملاء

source: Transaction Count
ar: عدد المعاملات

source: Total Credit
ar: إجمالي لك

source: Total Debit
ar: إجمالي عليك

source: Total Balance
ar: الرصيد الإجمالي

source: Top Clients (by Balance)
ar: أكبر العملاء (حسب الرصيد)

# reportGeneratedBy
source: This report was generated by {appName}
ar: تم إنشاء هذا التقرير بواسطة {appName}

# csvHeaderClientName
source: Client Name
ar: اسم العميل

# csvHeaderPhone
source: Phone
ar: رقم الهاتف

# csvHeaderCredit
source: Credit
ar: لك

# csvHeaderDebit
source: Debit
ar: عليك

# csvHeaderBalance
source: Balance
ar: الرصيد

# csvHeaderTxCount
source: Transaction Count
ar: عدد المعاملات

# csvHeaderDate
source: Date
ar: التاريخ

# clientAnalysisCSVTitle
source: Client Analysis - {appName}
ar: تحليل العملاء - {appName}

# transactionTrendsCSVTitle
source: Transaction Trends - {appName}
ar: اتجاهات المعاملات - {appName}

# textSummaryReportTitle
source: Accounts Summary Report - {appName}
ar: تقرير ملخص الحسابات - {appName}

# textSummaryTotalClients
source: Total Clients: {count}
ar: إجمالي العملاء: {count}

# textSummaryClientsWithCredit
source: With Credit: {count}
ar: لهم رصيد: {count}

# textSummaryClientsWithDebit
source: With Debit: {count}
ar: عليهم رصيد: {count}

# textSummaryBalancedClients
source: Balanced: {count}
ar: متوازن: {count}

# textSummaryLargestAbs
source: Largest (abs): {name} | {balance}
ar: الأكبر (قيمة مطلقة): {name} | {balance}

# textSummarySmallestAbs
source: Smallest (abs): {name} | {balance}
ar: الأصغر (قيمة مطلقة): {name} | {balance}

# textSummaryMostActive
source: Most Active: {name} | Txs: {count}
ar: الأنشط: {name} | معاملات: {count}

source: Edit Transaction
ar: تعديل المعاملة

# addTransactionTitle
source: Add Transaction
ar: إضافة معاملة

source: Save
ar: حفظ

source: Amount
ar: المبلغ

# enterAmount
source: Enter the amount
ar: ادخل المبلغ

source: Details
ar: التفاصيل

# enterDetailsOptional
source: Enter transaction details (optional)
ar: ادخل تفاصيل المعاملة (اختياري)

# currencyLabel
source: Currency:
ar: العملة:

# transactionTypeLabel
source: Transaction Type:
ar: نوع المعاملة:

source: Date
ar: التاريخ

# pleaseEnterAmount
source: Please enter the amount
ar: من فضلك ادخل المبلغ

# pleaseEnterValidAmount
source: Please enter a valid amount
ar: ادخل مبلغ صحيح

# amountTooLarge
source: Amount is too large
ar: المبلغ كبير جداً

# pleaseSelectDate
source: Please select the date
ar: من فضلك اختر التاريخ

source: Transaction updated
ar: تم تحديث المعاملة

source: Transaction added
ar: تم إضافة المعاملة

source: Failed to save transaction
ar: فشل في حفظ المعاملة

# errorOccurred
source: Error: {error}
ar: خطأ: {error}

source: General Settings
ar: الإعدادات العامة

source: Data Management
ar: إدارة البيانات

source: Contact Us
ar: تواصل معنا

source: Default Currency
ar: العملة الافتراضية

source: App Lock
ar: قفل التطبيق

# lockEnabled
source: Enabled
ar: مُفعّل

# lockDisabled
source: Disabled
ar: غير مُفعّل

source: Theme
ar: الثيم

source: Language
ar: اللغة

source: Notifications
ar: الإشعارات

source: Enable app notifications
ar: تفعيل إشعارات التطبيق

source: Backup
ar: نسخ احتياطي

source: Restore Data
ar: استعادة البيانات

source: Delete All Data
ar: حذف جميع البيانات

# deleteAllDataSubtitle
source: Permanently delete all transactions
ar: حذف جميع المعاملات نهائياً

source: Technical Support
ar: الدعم الفني

# technicalSupportSubtitle
source: Contact us to solve your problems
ar: تواصل معنا لحل مشاكلك

source: Logout
ar: تسجيل الخروج

# storagePermissionRequired
source: Please grant storage permission
ar: يرجى إعطاء إذن التخزين

# backupSaved
source: Backup saved successfully
ar: تم حفظ النسخة الاحتياطية

# restoreFilePickerTitle
source: Choose a backup file to restore
ar: اختر ملف النسخة للاستعادة

# dataRestored
source: Data restored successfully
ar: تم استعادة البيانات

# allDataDeleted
source: All data has been deleted
ar: تم حذف جميع البيانات

source: WhatsApp
ar: واتساب

source: Phone Call
ar: اتصال هاتفي

source: SMS Message
ar: رسالة SMS

# whatsappInquiry
source: Hello, I would like to inquire...
ar: مرحبًا، اود الاستفسار...

# smsHelpMessage
source: Hello, I need help
ar: مرحبًا، احتاج مساعدة

source: Select Default Currency
ar: اختر العملة الافتراضية

source: Select Theme
ar: اختر الثيم

source: Select Language
ar: اختر اللغة

# confirmDeleteAllTitle
source: Delete All Data
ar: حذف جميع البيانات

# confirmDeleteAllContent
source: Are you sure you want to delete all data? Clients and their transactions will be deleted.
ar: هل تريد حذف جميع البيانات؟ سيتم حذف العملاء ومعاملاتهم.

# themeLight
source: Light
ar: فاتح

# themeDark
source: Dark
ar: داكن

# themeSystem
source: System
ar: النظام

source: Edit Client
ar: تعديل العميل

source: Add Client
ar: إضافة عميل

# clientNameLabel
source: Client Name *
ar: اسم العميل *

# enterClientNameHint
source: Enter client's name
ar: ادخل اسم العميل

# pleaseEnterClientName
source: Please enter the client's name
ar: من فضلك ادخل اسم العميل

# nameTooLong
source: Name cannot exceed {maxLength} characters
ar: الاسم لا يزيد عن {maxLength} حرف

# phoneNumberLabel
source: Phone Number
ar: رقم الهاتف

# enterPhoneNumberHint
source: Enter phone number (optional)
ar: ادخل رقم الهاتف (اختياري)

# pickFromContactsTooltip
source: Pick from contacts
ar: اختر من جهات الاتصال

source: Failed to get contact
ar: فشل في جلب جهة الاتصال

# contactsPermissionNeeded
source: Contacts permission is required
ar: يجب منح صلاحية الوصول لجهات الاتصال

# phoneHelperText
source: International format is allowed (e.g., +967717281413)
ar: يمكن إدخال رقم دولي (مثال: 967717281413+)

# invalidPhoneNumber
source: Enter a valid phone number
ar: أدخل رقم هاتف صحيح

# phoneNumberTooShort
source: Phone number is too short
ar: الرقم قصير جدًا

# phoneNumberTooLong
source: Phone number is too long
ar: الرقم طويل جدًا

# accountTypeLabel
source: Account Type
ar: نوع الحساب

# selectOrEnterAccountTypeHint
source: Select or type an account type
ar: اختر أو اكتب نوع الحساب

# pleaseSelectAccountType
source: Please select an account type
ar: اختر نوع الحساب

# clientTypeCustomers
source: Customers
ar: عملاء

# clientTypeSuppliers
source: Suppliers
ar: موردين

# clientTypeOther
source: Other
ar: آخر
